# Writing data to and reading data from a Database using Python

## Libraries and settings

In [5]:
# Libraries
import os
import sqlite3
import fnmatch
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# Ignore warnings
import warnings
warnings.filterwarnings("ignore")

# Function to close a sqlite db-connection
def check_conn(conn):
     try:
        conn.cursor()
        return True
     except Exception as ex:
        return False

# Get current working directory
print(os.getcwd())

/Users/darioholenstein/Documents/zhaw/data-analytics/data_analytics/Week_02

## Create sqlite data base

In [6]:
# Create data base
conn = sqlite3.connect('supermarket_database.db') 
cursor = conn.cursor()

# Show dbs in the directory
flist = fnmatch.filter(os.listdir('.'), '*.db')
for i in flist:
    print(i)

supermarket_database.db
apartment_database.db

## Create SQL-table in the database

In [7]:
cursor.execute('''CREATE TABLE IF NOT EXISTS supermarkets_table (Id VARCHAR(50),
                                                               City VARCHAR(200),
                                                               Brand DECIMAL(8,2))''')
# Confirm changes to the table
conn.commit()

## Read data from file to data frame

In [8]:
df = pd.read_csv('supermarkets_data_prepared.csv', 
                  sep=',', 
                  encoding='utf-8')[['id', 'city', 'brand']]
print(df.shape)
df.head(5)

(3392, 3)

         id    city   brand
0  33126515     NaN    Spar
1  36726161  Uznach  Migros
2  39768209  Uznach    Coop
3  39947904  Z端rich    Coop
4  48932835  Z端rich  Migros

## Write data to the SQL-table in data base

In [9]:
df.to_sql(name = 'supermarkets_table',
          con = conn,
          index = False,
          if_exists = 'replace')

3392

## Query the SQL-table

In [12]:
# Query the SQL-table
cursor.execute('''SELECT *
               FROM supermarkets_table
               WHERE city =="Winterthur"''')

df = pd.DataFrame(cursor.fetchall(), 
                  columns=['Id','City','Brand'])    
df

             Id        City          Brand
0      70656488  Winterthur         Migros
1     246533376  Winterthur         Migros
2     548919417  Winterthur         Migros
3     677194765  Winterthur           None
4     706203439  Winterthur           None
5     709022324  Winterthur           None
6    1328945987  Winterthur         Migros
7    1519474175  Winterthur         Denner
8    3831772784  Winterthur         Migros
9    4058248551  Winterthur         Migros
10   4095400178  Winterthur           None
11   4095400190  Winterthur           ALDI
12   4109460421  Winterthur           None
13   4125136758  Winterthur           None
14   4189897383  Winterthur           None
15   4209642918  Winterthur           None
16   4379763119  Winterthur       Alnatura
17   4471606841  Winterthur         Migros
18   4816412575  Winterthur         Migros
19   4978196565  Winterthur           None
20   7418113614  Winterthur           Coop
21   7685095602  Winterthur  Migros-Outlet
22   8519878942  Winterthur           None
23   9040336565  Winterthur         Migros
24   9040336566  Winterthur         Denner
25   9985258254  Winterthur           ALDI
26  10221262155  Winterthur           None